{
	"intents": [
		{
			"tag": "greeting",
			"patterns": [
				"Hi there",
				"Is anyone there?",
				"Hey",
				"Hola",
				"Hello",
				"Good day"
			],
			"responses": [
				"Hello, how can I help?",
				"Good to see you again",
				"Hi there, how can I help?"
			]
		},
		{
			"tag": "goodbye",
			"patterns": [
				"Bye",
				"See you later",
				"Goodbye",
				"Nice chatting to you, bye",
				"Till next time",
				"No, that's it"
			],
			"responses": ["See you!", "Have a nice day", "Bye! Come back again soon."]
		},
		{
			"tag": "thanks",
			"patterns": [
				"Thanks",
				"Thank you",
				"That's helpful",
				"Awesome, thanks",
				"Thanks for helping me"
			],
			"responses": ["Happy to help!", "Any time!", "My pleasure"]
		},
		{
			"tag": "noanswer",
			"patterns": [],
			"responses": [
				"Sorry, can't understand you",
				"Please give me more info",
				"Not sure I understand"
			]
		},
		{
			"tag": "options",
			"patterns": [
				"How you could help me?",
				"What help you provide?",
				"How you can be helpful?",
				"What support is offered"
			],
			"responses": [
				"I can help you with the tutorial of the program",
				"I can tell you information about investment"
			]
		},
		{
			"tag": "joke",
			"patterns": [
				"Tell me a joke",
				"I am feeling bored",
				"Joke please",
				"Make me laugh",
				"I want to laugh"
			],
			"responses": [
				"Here's a joke to lighten your mood \nMy roommate and I are ordering some Chinese food for delivery. \nShe asks \"what's a good tip for a delivery driver\"\nI reply \"always wear a seat belt\"\nShe won't talk to me now.",
				"Guy staring at an ambulance in front of Whole Foods:\n “Somebody must have accidentally eaten gluten.",
				"What has T in the beginning, T in the middle, and T at the end? \n- A teapot."
			]
		},
		{
			"tag": "cryptocurrency",
			"patterns": [
				"tell short about cryptocurrency",
				"what is cryptocurrency",
				"how can I get information about cryptocurrency"
			],
			"responses": [
				"A cryptocurrency is a digital or virtual currency that is secured by cryptography, which makes it nearly impossible to counterfeit or double-spend. A cryptocurrency is a form of digital asset based on a network that is distributed across a large number of computers. This decentralized structure allows them to exist outside the control of governments and central authorities. "
			]
		},
		{
			"tag": "bitcoin",
			"patterns": [
				"what is bitcoin",
				"how to get a bitcoin"
			],
			"responses": [

			]
		},
		{
			"tag": "schemes",
			"patterns": [
				"which schemes are you provided to users ",
				"which scheme is best",
				"how will you provide information of schemes"
			],
			"responses": [
				"well. Saving Schemes are launched by the Government of India or public sector financial institutions or banks and they offer reliability and risk-free returns on investment.the schemes which provided by us to users are FD,RD,PPF,MIS,NSC etc. Public provident fund is one of the best scheme ever."
			]
		},
		{
			"tag": "fd",
			"patterns": [
				"what is FD",
				"which subtypes included in FD",
				"Is FD's are profitable",
				"how can I invest in them"
			],
			"responses": [
				"that's the good thing. fixed deposit (FD) is a financial instrument provided by banks or NBFCs which provides investors a higher rate of interest than a regular savings account, until the given maturity date. .there are also thier sub types which you can see in our website details."
			]
		},
		{
			"tag": "rd",
			"patterns": [
				"I'm excited to know how  RD is work.",
				"advantages of RD",
				"types of RD's"
			],
			"responses": [
				"off course.our website gives brief info about  RD, thier types,scope,percentage of investment in it.In short A recurring deposit is a special kind of term deposit offered by banks which help people with regular incomes to deposit a fixed amount every month into their recurring deposit account and earn interest at the rate applicable to fixed deposits. "
			]
		},
		{
			"tag": "fd_rd",
			"patterns": ["which is better RD or FD"],
			"responses": [
				"According to new definations or schemes of banks,The interest amount earned at the end of maturity of a Fixed Deposit is higher than the interest earned on an RD. The interest amount earned is lesser than the interest earned on an FD. The interest earned on an RD is paid on maturity along with the capital amount."
			]
		},
		{
			"tag": "stock-market",
			"patterns": [
				"give guidelines about stock market",
				"have I invest my money in stocks",
				"how you will give me information about stock market",
				" why the stock market",
				" What is stock market simple definition?"
			],
			"responses": [
				"It is a place where shares of pubic listed companies are traded. The primary market is where companies float shares to the general public in an initial public offering (IPO) to raise capital. Thus, it is the meeting place of the stock buyers and sellers.For detail info check our stock market page."
			]
		},
		{
			"tag": " expenses ",
			"patterns": ["how will I go to expenses page on your website"],
			"responses": [
				"1.after login to money manager application there are several options .2.Go to left corner and click on expenses tab,3.tab will be open, now you will be able to fillupt or manage your expenses"
			]
		},
		{
			"tag": "expenses-management",
			"patterns": [
				"I'm unable to fill \"manage your expenses\" on expenses tab, can you help me?",
				"how to fill expenses give me short idea"
			],
			"responses": ["bot kay bolnar ahe te"]
		},
		{
			"tag": "calculator",
			"patterns": ["what facilities provided by banking calculator"],
			"responses": [
				"calculator gives short idea about which quantities you are filling.you will be able to select your bank,select investment scheme after that you will be able to see your current interest rate,maturity date, maturity ammount etc."
			]
		},
		{
			"tag": "profile",
			"patterns": ["how I can make my own profile?"],
			"responses": [
				"when you will goes to money manager application..their is option for sign in or when you have not account then choose \"don't have an account\" option  then sign up."
			]
		},
		{
			"tag": "real_estate",
			"patterns": [
				"what is real estate",
				"types of real estate",
				" is it profitable to me",
				"can I invest money in real estate"
			],
			"responses": [
				"Real estate is property consisting of land and the buildings on it, along with its natural resources such as crops, minerals or water; immovable property of this nature; an interest vested in this an item of real property, buildings or housing in general.For more details browse our real estate page."
			]
		},
		{
			"tag": "investment",
			"patterns": [
				"as I invest money in FD's...can I see my previous investments?"
			],
			"responses": [
				"yeah ! The great thing of our application is providing info to users which is easy to operate themselves. You can be able to check your investments, scheme name,their time span, amount invested and maturity amount as option."
			]
		},
		{
			"tag": "blogs",
			"patterns": [
				"Which things you added in your blogs",
				"how can I get access to blogs",
				"is there any configuration for reading blogs"
			],
			"responses": [
				"That's the big deal. You will be able to read each portfolio on blogs by clicking on it.the providing information is very helpful to users because we can gave the successful example of a person who is financial expert. are u curious to read it then goes to respective page and inhance your knowledgeThank you, for asking such kind information."
			]
		}
	]
}
